miketsukerman/openbsw/platforms/stm32/bsp/bspIo/src/io/Gpio.cpp
/********************************************************************************
 * Copyright (c) 2026 An Dao
 *
 * This program and the accompanying materials are made available under the
 * terms of the Apache License Version 2.0 which is available at
 * https://www.apache.org/licenses/LICENSE-2.0
 *
 * SPDX-License-Identifier: Apache-2.0
 ********************************************************************************/

#include <io/Gpio.h>

namespace bios
{

void Gpio::enablePortClock(GPIO_TypeDef* port)
{
#if defined(STM32G474xx)
    if (port == GPIOA)
    {
        RCC->AHB2ENR |= RCC_AHB2ENR_GPIOAEN;
    }
    else if (port == GPIOB)
    {
        RCC->AHB2ENR |= RCC_AHB2ENR_GPIOBEN;
    }
    else if (port == GPIOC)
    {
        RCC->AHB2ENR |= RCC_AHB2ENR_GPIOCEN;
    }
#if defined(GPIOD)
    else if (port == GPIOD)
    {
        RCC->AHB2ENR |= RCC_AHB2ENR_GPIODEN;
    }
#endif
#if defined(GPIOE)
    else if (port == GPIOE)
    {
        RCC->AHB2ENR |= RCC_AHB2ENR_GPIOEEN;
    }
#endif
#if defined(GPIOF)
    else if (port == GPIOF)
    {
        RCC->AHB2ENR |= RCC_AHB2ENR_GPIOFEN;
    }
#endif
#if defined(GPIOG)
    else if (port == GPIOG)
    {
        RCC->AHB2ENR |= RCC_AHB2ENR_GPIOGEN;
    }
#endif
#elif defined(STM32F413xx)
    if (port == GPIOA)
    {
        RCC->AHB1ENR |= RCC_AHB1ENR_GPIOAEN;
    }
    else if (port == GPIOB)
    {
        RCC->AHB1ENR |= RCC_AHB1ENR_GPIOBEN;
    }
    else if (port == GPIOC)
    {
        RCC->AHB1ENR |= RCC_AHB1ENR_GPIOCEN;
    }
    else if (port == GPIOD)
    {
        RCC->AHB1ENR |= RCC_AHB1ENR_GPIODEN;
    }
#if defined(GPIOE)
    else if (port == GPIOE)
    {
        RCC->AHB1ENR |= RCC_AHB1ENR_GPIOEEN;
    }
#endif
#if defined(GPIOF)
    else if (port == GPIOF)
    {
        RCC->AHB1ENR |= RCC_AHB1ENR_GPIOFEN;
    }
#endif
#if defined(GPIOG)
    else if (port == GPIOG)
    {
        RCC->AHB1ENR |= RCC_AHB1ENR_GPIOGEN;
    }
#endif
#if defined(GPIOH)
    else if (port == GPIOH)
    {
        RCC->AHB1ENR |= RCC_AHB1ENR_GPIOHEN;
    }
#endif
#elif defined(STM32H747xx)
    if (port == GPIOA)
    {
        RCC->AHB4ENR |= RCC_AHB4ENR_GPIOAEN;
    }
    else if (port == GPIOB)
    {
        RCC->AHB4ENR |= RCC_AHB4ENR_GPIOBEN;
    }
    else if (port == GPIOC)
    {
        RCC->AHB4ENR |= RCC_AHB4ENR_GPIOCEN;
    }
    else if (port == GPIOD)
    {
        RCC->AHB4ENR |= RCC_AHB4ENR_GPIODEN;
    }
    else if (port == GPIOE)
    {
        RCC->AHB4ENR |= RCC_AHB4ENR_GPIOEEN;
    }
    else if (port == GPIOF)
    {
        RCC->AHB4ENR |= RCC_AHB4ENR_GPIOFEN;
    }
    else if (port == GPIOG)
    {
        RCC->AHB4ENR |= RCC_AHB4ENR_GPIOGEN;
    }
    else if (port == GPIOH)
    {
        RCC->AHB4ENR |= RCC_AHB4ENR_GPIOHEN;
    }
#if defined(GPIOI)
    else if (port == GPIOI)
    {
        RCC->AHB4ENR |= RCC_AHB4ENR_GPIOIEN;
    }
#endif
#if defined(GPIOJ)
    else if (port == GPIOJ)
    {
        RCC->AHB4ENR |= RCC_AHB4ENR_GPIOJEN;
    }
#endif
#if defined(GPIOK)
    else if (port == GPIOK)
    {
        RCC->AHB4ENR |= RCC_AHB4ENR_GPIOKEN;
    }
#endif
#endif
    // Read-back for clock stabilization
    uint32_t volatile dummy;
    (void)dummy;
#if defined(STM32G474xx)
    dummy = RCC->AHB2ENR;
#elif defined(STM32F413xx)
    dummy = RCC->AHB1ENR;
#elif defined(STM32H747xx)
    dummy = RCC->AHB4ENR;
#endif
    (void)dummy;
}

void Gpio::configure(GpioConfig const& cfg)
{
    enablePortClock(cfg.port);
    setMode(cfg.port, cfg.pin, cfg.mode);
    setOutputType(cfg.port, cfg.pin, cfg.otype);
    setSpeed(cfg.port, cfg.pin, cfg.speed);
    setPull(cfg.port, cfg.pin, cfg.pull);
    if ((cfg.mode == GpioMode::ALTERNATE) && (cfg.af <= 15U))
    {
        setAlternateFunction(cfg.port, cfg.pin, cfg.af);
    }
}

void Gpio::setMode(GPIO_TypeDef* port, uint8_t pin, GpioMode mode)
{
    uint32_t pos = pin * 2U;
    port->MODER  = (port->MODER & ~(3U << pos)) | (static_cast<uint32_t>(mode) << pos);
}

void Gpio::setOutputType(GPIO_TypeDef* port, uint8_t pin, GpioOutputType otype)
{
    if (otype == GpioOutputType::OPEN_DRAIN)
    {
        port->OTYPER |= (1U << pin);
    }
    else
    {
        port->OTYPER &= ~(1U << pin);
    }
}

void Gpio::setSpeed(GPIO_TypeDef* port, uint8_t pin, GpioSpeed speed)
{
    uint32_t pos  = pin * 2U;
    port->OSPEEDR = (port->OSPEEDR & ~(3U << pos)) | (static_cast<uint32_t>(speed) << pos);
}

void Gpio::setPull(GPIO_TypeDef* port, uint8_t pin, GpioPull pull)
{
    uint32_t pos = pin * 2U;
    port->PUPDR  = (port->PUPDR & ~(3U << pos)) | (static_cast<uint32_t>(pull) << pos);
}

void Gpio::setAlternateFunction(GPIO_TypeDef* port, uint8_t pin, uint8_t af)
{
    uint8_t afrIdx    = (pin < 8U) ? 0U : 1U;
    uint8_t afrPin    = (pin < 8U) ? pin : (pin - 8U);
    uint32_t pos      = afrPin * 4U;
    port->AFR[afrIdx] = (port->AFR[afrIdx] & ~(0xFU << pos)) | (static_cast<uint32_t>(af) << pos);
}

bool Gpio::readPin(GPIO_TypeDef* port, uint8_t pin) { return (port->IDR & (1U << pin)) != 0U; }

void Gpio::writePin(GPIO_TypeDef* port, uint8_t pin, bool high)
{
    if (high)
    {
        port->BSRR = (1U << pin);
    }
    else
    {
        port->BSRR = (1U << (pin + 16U));
    }
}

void Gpio::togglePin(GPIO_TypeDef* port, uint8_t pin) { port->ODR ^= (1U << pin); }

} // namespace bios
